<?php
namespace app\api\controller;

class ReturnCode
{
    static public $return_code = [
        '200'  => '邀请成功，访客已绑定微信服务号，发送模板消息成功',
        '201'  => '邀请成功，访客已绑定微信服务号，但发送模板消息失败',
        '202'  => '邀请成功，访客未绑定微信服务号',
        '1001' => '访客姓名为空', 
        '1002' => '访客手机号码为空', 
        '1003' => '来访日期为空', 
        '1004' => '来访时间段为空', 
        '1005' => '被访员工姓名为空', 
        '1006' => '被访员工ID为空',
        '1007' => '来访人数为空',
        '1008' => '申请人姓名为空',
        '1009' => '申请人电话为空',
        '1010' => '来访人数为非数字',
        '1011' => '来访时间段为非数字',
        '1012' => 'Token未授权',
        '1030' => '数据操作失败',

        '1101' => 'token不合法',
        '1102' => 'token未授权',
        '1103' => '门禁号码不合法',
        '1104' => '人员姓名不合法',
        '1105' => '人员类型不合法',
        '1106' => '刷卡时间不合法',
        '1107' => '刷卡门点不合法',
        '1108' => '刷卡事件不合法',
        '1109' => '数据操作失败',
        '1110' => '记录id不合法',
        '1111' => '记录不存在',

    ];
}